In [2]:
import pandas as pd

# Series object

In [4]:
students = ["Alice", "Jack", "Molly"]

pd.Series(students)

0    Alice
1     Jack
2    Molly
dtype: object

In [5]:
numbers = [1, 2, 3]

pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [6]:
students = ["Alice", "Jack", None]
pd.Series(students)

0    Alice
1     Jack
2     None
dtype: object

In [7]:
numbers = [1, 2, None]

pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [8]:
import numpy as np

np.nan == None

False

In [10]:
np.nan == np.nan

False

In [11]:
np.isnan(np.nan)

True

In [14]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths"}

s = pd.Series(student_subjects)
s

Alice    Physics
Jack        Chem
Molly      Maths
dtype: object

In [16]:
s.index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [17]:
students = [("Alice", "Brown"), ("Jack", "Willis"), ("Molly", "Davies")]

s = pd.Series(students)

In [18]:
s

0     (Alice, Brown)
1     (Jack, Willis)
2    (Molly, Davies)
dtype: object

In [19]:
s = pd.Series(["Physics", "Chemistry", "Maths"], index=["Alice", "Jack", "Molly"])
s

Alice      Physics
Jack     Chemistry
Molly        Maths
dtype: object

In [20]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths"}

s = pd.Series(student_subjects, index=["Alice", "Molly", "Sam"])
s

Alice    Physics
Molly      Maths
Sam          NaN
dtype: object

In [22]:
student_subjects = {"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths",
                   "Sam" : "Comp Sci"}

s = pd.Series(student_subjects)

s

Alice     Physics
Jack         Chem
Molly       Maths
Sam      Comp Sci
dtype: object

In [23]:
s.iloc[3]

'Comp Sci'

In [24]:
s.loc["Jack"]

'Chem'

In [25]:
s[3]

'Comp Sci'

In [26]:
s.loc["Jack"]

'Chem'

In [27]:
class_code = {99: "Physics",
             100: "Chem",
             101: "Physics",
             102: "Comp Sci"}

c = pd.Series(class_code)

In [28]:
c[0]

KeyError: 0

In [29]:
c.iloc[0]

'Physics'

In [30]:
grades = pd.Series([90, 80, 70, 60, 10, 30, 30, 12, 42, 54, 50, 97])
total = 0
for grade in grades:
    total+=grade

print(total/len(grades))

52.083333333333336

In [31]:
total = np.sum(grades)
print(total/len(grades))

52.083333333333336

In [32]:
grades = pd.Series(np.random.randint(0, 100, 10000))

grades.head()

0    54
1    41
2    12
3    90
4    25
dtype: int32

In [33]:
len(grades)

10000

In [36]:
%%timeit -n 100

total = 0
for grade in grades:
    total+=grade
averag = total/len(grades)

1.22 ms ± 138 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [37]:
%%timeit -n 100

average = np.sum(grades)/len(grades)

97.8 µs ± 21.9 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [38]:
grades+=5

grades.head()

0    59
1    46
2    17
3    95
4    30
dtype: int32

In [51]:
for label, value in grades.items():
    grades.at[label] = value+2

In [44]:
grades.head()

0    61
1    48
2    19
3    97
4    32
dtype: int32

In [49]:
student_subjects = pd.Series({"Alice": "Physics",
                   "Jack" : "Chem",
                   "Molly" : "Maths",
                   "Sam" : "Comp Sci"})

In [46]:
Kelly_Classes = pd.Series(["FM", "Maths", "Physics", "Economics"], index=["Kelly", "Kelly", "Kelly", "Kelly"])
Kelly_Classes

Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [55]:
all_student_subjects = student_subjects.append(Kelly_Classes)
all_student_subjects

C:\Users\mohka\AppData\Local\Temp\ipykernel_40212\2049188880.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_student_subjects = student_subjects.append(Kelly_Classes)

Alice      Physics
Jack          Chem
Molly        Maths
Sam       Comp Sci
Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [56]:
all_student_subjects.loc["Kelly"]

Kelly           FM
Kelly        Maths
Kelly      Physics
Kelly    Economics
dtype: object

In [57]:
all_student_subjects.iloc[5]

'Maths'

# DataFrames

In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({"Name": "Mark",
                    "Class": "Maths",
                    "Score": 92})

record2 = pd.Series({"Name": "Helen",
                    "Class": "Comp Sci",
                    "Score": 89})

record3 = pd.Series({"Name": "Jenna",
                    "Class": "Physics",
                    "Score": 95})

In [7]:
df = pd.DataFrame([record1, record2, record3], index=["School1", "School2", "School1"])

In [8]:
df.head()

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [10]:
students = [{"Name": "Mark",
            "Class": "Maths",
            "Score": 92},
           {"Name": "Helen",
            "Class": "Comp Sci",
            "Score": 89},
           {"Name": "Jenna",
            "Class": "Physics",
            "Score": 95}]

df = pd.DataFrame(students, index=["School1", "School2", "School1"])

In [11]:
df.head()

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [12]:
df.loc["School2"]

Name        Helen
Class    Comp Sci
Score          89
Name: School2, dtype: object

In [13]:
type(df.loc["School2"])

pandas.core.series.Series

In [14]:
df.loc["School1"]

          Name    Class  Score
School1   Mark    Maths     92
School1  Jenna  Physics     95

In [15]:
type(df.loc["School1"])

pandas.core.frame.DataFrame

In [16]:
df.loc["School1", "Name"]

School1     Mark
School1    Jenna
Name: Name, dtype: object

In [17]:
df.T

      School1   School2  School1
Name     Mark     Helen    Jenna
Class   Maths  Comp Sci  Physics
Score      92        89       95

In [18]:
df.T.loc["Name"]

School1     Mark
School2    Helen
School1    Jenna
Name: Name, dtype: object

In [19]:
df["Name"]

School1     Mark
School2    Helen
School1    Jenna
Name: Name, dtype: object

In [20]:
df.loc["School1"]["Name"]

School1     Mark
School1    Jenna
Name: Name, dtype: object

In [21]:
df.loc[:, ["Name", "Score"]]

          Name  Score
School1   Mark     92
School2  Helen     89
School1  Jenna     95

In [22]:
df.drop("School1")

          Name     Class  Score
School2  Helen  Comp Sci     89

In [23]:
df

          Name     Class  Score
School1   Mark     Maths     92
School2  Helen  Comp Sci     89
School1  Jenna   Physics     95

In [24]:
copy_df = df.copy()

In [25]:
copy_df.drop("Name", inplace=True, axis=1)

In [26]:
copy_df

            Class  Score
School1     Maths     92
School2  Comp Sci     89
School1   Physics     95

In [27]:
del copy_df["Class"]

In [28]:
copy_df

         Score
School1     92
School2     89
School1     95

In [29]:
df["ClassRanking"] = None
df

          Name     Class  Score ClassRanking
School1   Mark     Maths     92         None
School2  Helen  Comp Sci     89         None
School1  Jenna   Physics     95         None

# DataFrame Indexing and Loading

In [30]:
!cat Admissions_Predict.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [42]:
df = pd.read_csv("Admission_Predict.csv")

In [43]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [44]:
df = pd.read_csv("Admission_Predict.csv", index_col=0)
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [45]:
new_df = df.rename(columns={"GRE Score": "GRE Score",
                            "University Rating" : "University Rating",
                            "SOP":"Statement of Purpose", 
                           "LOR":"Letter of Recommendation",
                           "CGPA": "CGPA",
                           "Research":"Research",
                           "Chance of Admit": "Chance of Admit"})

new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [46]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [47]:
new_df = new_df.rename(columns={"LOR ": "Letter of Recommendation"})
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [48]:
new_df = new_df.rename(mapper=str.strip, axis="columns")
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [50]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [51]:
cols = list(df.columns)

In [52]:
cols = [x.lower().strip() for x in cols]
df.columns = cols
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65